# ============================================ №3
# имеется список списков
# a = [[1,2,3], [4,5,6]]

# Задание:
# сделать список словарей
# b = [{'k1': 1, 'k2': 2, 'k3': 3}, {'k1': 4, 'k2': 5, 'k3': 6}]

# *написать решение в одну строку

if __name__ == '__main__':
    a = [[1,2,3], [4,5,6]] # Условие задачи
        
    b = []    
    for i in a:
        count = 1
        dictionary = {}
        for j in i:
            dictionary['k' + str(count)] = j
            count +=1
        b.append(dictionary)
    
    print(b)
    
    
    
    
    